Revit 2025 API
PipeLossMethodType Enumeration
An enumerated type listing all pipe loss method types for a connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PipeLossMethodType
Public Enumeration PipeLossMethodType
public enum class PipeLossMethodType
type PipeLossMethodType
Members
Member name | Value | Description
NotDefined | 0 | pipe loss method is undefined.
Table | 1 | pipe loss method is depend on the coefficient from table.
SpecificLoss | 4 | pipe loss method is specified.
Coefficient | 6 | pipe loss method depend on coefficient.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace